app/controllers/api/v1/photos_controller.rb

  def index
    respond_with Photo.all
---
SELECT "photos".* FROM "photos"