app/controllers/api/v1/pianos_controller.rb

  def index
    respond_with Piano.all
---
SELECT  "pianos".* FROM "pianos" ORDER BY "pianos"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def create
    respond_with :api, :v1, Piano.create(piano_params)
---
INSERT INTO "pianos" ("make", "model", "year", "description", "photo", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    respond_with Piano.destroy(params[:id])
---
DELETE FROM "pianos" WHERE "pianos"."id" = ?  [["id", 29]]

  def find_photos
    piano = Piano.find(params[:id])
---
SELECT  "pianos".* FROM "pianos" WHERE "pianos"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]