app/controllers/detail_pictures_controller.rb

  def index
    @pic_images = []
    @detail_pictures = DetailPicture.all
---
SELECT "detail_pictures".* FROM "detail_pictures"

  def create
    @detail_picture = DetailPicture.new(detail_picture_params)

    respond_to do |format|
      if @detail_picture.save
---
INSERT INTO "detail_pictures" ("image_uid", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image_uid", "2017/03/09/2tpgkct7yj_piano2.jpg"], ["title", "this"], ["created_at", 2017-03-09 20:26:52 UTC], ["updated_at", 2017-03-09 20:26:52 UTC]]

    def set_detail_picture
      @detail_picture = DetailPicture.find(params[:id])
---
SELECT  "detail_pictures".* FROM "detail_pictures" WHERE "detail_pictures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]